In [1]:
import mysql.connector
import pandas as pd

In [2]:
data = pd.read_csv('redbus_data.csv')
data.head()

,Bus_name,Bus_type,Start_time,End_time,Duration,Price,Seats_Available,Route_name,Route_link
0,Navayuga Travels,A/C Sleeper (2+1),01:40,05:00,03h 20m,560.0,11 Seats available,Kakinada to Visakhapatnam,https://www.redbus.in/bus-tickets/kakinada-to-...
1,Gaganasri Travels,Non A/C Seater / Sleeper (2+1),23:50,03:30,03h 40m,5000.0,1 Seat available,Kakinada to Visakhapatnam,https://www.redbus.in/bus-tickets/kakinada-to-...
2,NueGo,Electric A/C Seater (2+2),05:00,11:25,06h 25m,332.0,14 Seats available,Bangalore to Tirupati,https://www.redbus.in/bus-tickets/bangalore-to...
3,FRESHBUS,Electric A/C Seater (2+2),06:00,12:20,06h 20m,450.0,26 Seats available,Bangalore to Tirupati,https://www.redbus.in/bus-tickets/bangalore-to...
4,NueGo,Electric A/C Seater (2+2),06:00,11:45,05h 45m,332.0,28 Seats available,Bangalore to Tirupati,https://www.redbus.in/bus-tickets/bangalore-to...

In [3]:
all_dfs = pd.DataFrame(data)

In [4]:
all_dfs = all_dfs.dropna()
data = all_dfs.values.tolist()

In [5]:
conn=mysql.connector.connect(host="localhost", user="root", password="jaini2002",database="RED_BUS_DETAILS")
my_cursor = conn.cursor()
my_cursor.execute("CREATE DATABASE IF NOT EXISTS RED_BUS_DETAILS")

In [6]:
# Table Creation
my_cursor.execute('''CREATE TABLE IF NOT EXISTS bus_details(
                  ID INT AUTO_INCREMENT PRIMARY KEY,
                  Bus_name VARCHAR(255) NOT NULL,
                  Bus_type VARCHAR(255) NOT NULL,
                  Start_time VARCHAR(255) NOT NULL,
                  End_time VARCHAR(255) NOT NULL,
                  Total_duration VARCHAR(255) NOT NULL,
                  Price FLOAT NULL,
                  Seats_Available VARCHAR(255) NOT NULL,
                  Route_link VARCHAR(255) NULL,
                  Route_name VARCHAR(255) NULL
                  )''')
print("Table Created successfully")

Table Created successfully

In [7]:
insert_query = '''INSERT INTO bus_details(
                    Bus_name,
                    Bus_type,
                    Start_time,
                    End_time,
                    Total_duration,
                    Price,
                    Seats_Available,
                    Route_link,
                    Route_name)
                  VALUES(%s, %s, %s, %s, %s, %s, %s, %s, %s)'''
data = all_dfs.values.tolist()

my_cursor.executemany(insert_query, data)

conn.commit()

print("Values inserted successfully")

Values inserted successfully